# StairsSupportOverridden Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupportOverridden Property
ParameterTypeId Class See Also
---
"Overridden": Overridden
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupportOverridden { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupportOverridden As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupportOverridden {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace